/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_exit.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rkitao <rkitao@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/02 17:50:11 by rkitao            #+#    #+#             */
/*   Updated: 2024/08/02 18:25:00 by rkitao           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "builtins.h"

int	ft_exit(t_cmd_info cmd_info, t_env_info env_info, int read_pipe, int write_pipe)
{
	//引数が多かったらエラー
	//引数が０こなら終了
	//１個めの引数を確認し、数値で範囲内かどうか確認する
	//　範囲内である場合、２個めの引数があればエラー、なければ256で割ったあまりで終了
	//　範囲内でない場合はエラーを出して終了
	(void)cmd_info;
	(void)env_info;
	(void)read_pipe;
	(void)write_pipe;
	return (0);
}